<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class GroupSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $groups = [
            'ไม่ระบุ',
            'กลุ่มงานผู้ป่วยนอก',
            'กลุ่มงานเวชกรรมฟื้นฟู',
            'กลุ่มงานเวชกรรมสังคม',
            'กลุ่มงานโสต ศอ นาสิก',
            'กลุ่มการพยาบาล',
            'กลุ่มงานกุมารเวชกรรม',
            'กลุ่มงานจักษุวิทยา',
            'กลุ่มงานจิตเวช',
            'กลุ่มงานทันตกรรม',
            'กลุ่มงานพยาธิวิทยากายวิภาค',
            'กลุ่มงานเทคนิคการแพทย์',
            'กลุ่มงานพัฒนาทรัพยากรบุคคล',
            'กลุ่มงานรังสีวิทยา',
            'กลุ่มงานวิสัญญีวิทยา',
            'กลุ่มงานศัลยกรรม',
            'กลุ่มงานศัลยกรรมออร์โธปิดิกส์',
            'กลุ่มงานสูติ-นรีเวชกรรม',
            'กลุ่มงานอายุรกรรม',
            'กลุ่มงานเวชศาสตร์ฉุกเฉินและนิติเวช',
            'กลุ่มงานศูนย์รับบริจาคโลหิต',
            'โรงพยาบาลพระปกเกล้า',
            'กลุ่มงานบริหารทั่วไป',
            'กลุ่มงานการเงิน',
            'กลุ่มงานพัสดุ',
            'กลุ่มงานโภชนศาสตร์',
            'กลุ่มงานสุขศึกษา',
            'กลุ่มงานเภสัชกรรม',
            'กลุ่มงานทรัพยากรบุคคล',
            'กลุ่มอำนวยการ',
            'กลุ่มงานสังคมสงเคราะห์',
            'กลุ่มงานบัญชี',
            'กลุ่มงานยุทธศาสตร์และแผนงานโครงการ',
            'สำนักงานหน่วยงานบริการด่านหน้าและกิจกรรมพิเศษ',
            'ศูนย์ภารกิจด้านเศรษฐกิจการคลัง',
            'กลุ่มงานเทคโนโลยีสารสนเทศ',
            'ศูนย์เวชศาสตร์ครอบครัว',
            'กลุ่มงานแพทย์แผนไทยและแพทย์ทางเลือก',
            'ศูนย์แพทยศาสตรศึกษาชั้นคลินิก',
            'โรงพยาบาลเมืองสาขา รพ.พระปกเกล้า',
            'กลุ่มงานนิติเวช',
            'กลุ่มงานอาชีวเวชกรรม',
            'องค์กรแพทย์',
            'กลุ่มงานพัฒนาคุณภาพบริการและมาตรฐาน',
            'กลุ่มงานสารสนเทศทางการแพทย์',
            'กลุ่มงานโครงสร้างพื้นฐานและวิศวกรรมทางการแพทย์',
            'กลุ่มงานการพยาบาลชุมชน',
            'กลุ่มงานประกันสุขภาพ',
            'ศูนย์อาหารโรงพยาบาลพระปกเกล้า',
            'กลุ่มงานดิจิทัลทางการแพทย์',
            'กลุ่มงานเวชระเบียนและข้อมูลทางการแพทย์',
            'กลุ่มงานพัฒนาคุณภาพบริการและวิชาการทันตกรรม',
            'กลุ่มงานบริการทันตกรรมปฐมภูมิและทุติยภูมิ',
            'กลุ่มงานข้อมูลทางการแพทย์',

        ];
        //
        foreach ($groups as $depart) {
            DB::table('groups')->insert([
                'group_name' => $depart,
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }
    }
}
