<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class JobPositionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $jobPositions = [
            'คนครัว',
            'พนักงานทั่วไป',
            'คนงานห้องทดลอง',
            'คนสวน',
            'เจ้าพนักงานการเงินและบัญชี',
            'เจ้าพนักงานธุรการ',
            'เจ้าพนักงานพัสดุ',
            'เจ้าพนักงานเภสัชกรรม',
            'เจ้าพนักงานวิทยาศาสตร์การแพทย์',
            'เจ้าพนักงานเวชกรรมฟื้นฟู',
            'เจ้าพนักงานโสตทัศนศึกษา',
            'เจ้าหน้าที่ธุรการ',
            'นักจัดการงานทั่วไป',
            'นักวิชาการพัสดุ',
            'เจ้าหน้าที่บันทึกข้อมูล',
            'เจ้าหน้าที่ประชาสัมพันธ์',
            'เจ้าหน้าที่พยาบาล',
            'เจ้าหน้าที่พัสดุ',
            'เจ้าหน้าที่พิมพ์ดีด',
            'เจ้าพนักงานรังสีการแพทย์',
            'เจ้าพนักงานเวชสถิติ',
            'เจ้าหน้าที่โสตทัศนศึกษา',
            'เจ้าพนักงานอาชีวบำบัด',
            'ช่างกายอุปกรณ์',
            'ช่างเชื่อม',
            'ช่างท่อ',
            'ช่างทันตกรรม',
            'ช่างเทคนิค',
            'ช่างปูน',
            'ช่างไฟฟ้า',
            'ช่างภาพการแพทย์',
            'ช่างไม้',
            'ช่างอิเลคโทรนิกส์',
            'ช่างอุปกรณ์การแพทย์',
            'ทันตแพทย์',
            'นักกายภาพบำบัด',
            'พนักงานสถานที่',
            'นักจิตวิทยา',
            'นักเทคนิคการแพทย์',
            'นักประชาสัมพันธ์',
            'นักโภชนาการ',
            'นักรังสีการแพทย์',
            'นักวิชาการควบคุมโรค',
            'นักวิชาการเงินและบัญชี',
            'นักวิชาการประกันภัย',
            'นักวิชาการศึกษา',
            'นักวิชาการส่งเสริมสุขภาพ',
            'นักวิชาการสาธารณสุข',
            'นักวิชาการสุขศึกษา',
            'นักวิชาการสุขาภิบาล',
        ];
        //
        foreach ($jobPositions as $position) {
            DB::table('job_positions')->insert([
                'job_position_name' => $position,
                'created_at' => now(),
                'updated_at' => now(),
            ]);
        }
    }
}
